In [1]:
import pandas as pd

In [3]:
dataFrame=pd.read_excel("Kitap1.xlsx")

In [4]:
dataFrame

  Unnamed: 0  MAAS   YAS  DEPARTMAN
0       ATIL   100  40.0    YAZILIM
1     ZEYNEP   150  50.0      SATIŞ
2     MEHMET   200  30.0        NaN
3      AHMET    50  10.0  PAZARLAMA
4      ATLAS   150   NaN     FİNANS
5      FATMA   200  25.0      HUKUK

In [11]:
doluDegerlerDataFrame=dataFrame.dropna() # sadece dolu olan değerler
doluDegerlerDataFrame

  Unnamed: 0  MAAS   YAS  DEPARTMAN
0       ATIL   100  40.0    YAZILIM
1     ZEYNEP   150  50.0      SATIŞ
3      AHMET    50  10.0  PAZARLAMA
5      FATMA   200  25.0      HUKUK

In [12]:
doluDegerlerDataFrame.to_excel("Kitap1.xlsx")